Создать класс билеты, в котором обязательно есть поля станция отправления, станция прибытия, время отправления и количество свободных билетов. Создать класс пассажир,
в котором обязательно есть поля фамилия, имя, станция отправления, станция прибытия, желаемое время отправления (раньше которого пассажир не может уехать) и
 поле куплен ли билет(если куплен, то указать номер рейса).

Что нужно сделать: при добавлении нового пассажира нужно найти ему подходящий поезд. Должна быть возможность выводить список всех пассажиров, список всех поездов.

Пример фрагмента таблицы пассажир:
Иванов Иван Москва Санкт-Петербург 14:00 145

Пример фрагмента таблицы билеты:
145 Москва Санкт-Петербург 14:02 2


добавление поезда, удаление поезда, вывод всех пассажиров на определенный рейс - поиск по номеру поезда